<?php

class sample
{
    public function sample(): void
    {
        if (true) {
            //
            // 数十〜数百行に及ぶ何かの処理
            //
            if (true) {
                //
                // 数十〜数百行に及ぶ何かの処理
                //
                if (true) {
                    //
                    // 数十〜数百行に及ぶ何かの処理
                    //
                    if (true) {
                        //
                        // 数十〜数百行に及ぶ何かの処理
                        //

                    }
                }
            }
            //
            // 数十〜数百行に及ぶ何かの処理
            //
        }
    }
    //
    // 数十〜数百行に及ぶ何かの処理
    //
}
